# coding=gbk
"""
author(作者): Channing Xie(谢琛)
time(时间): 2020/9/12 21:47
filename(文件名): test.py
function description(功能描述):
...
"""
all_ = ['鄢淦威', '关淙元', '何奕源', '李翔', '刘念', '刘行思', '夏楠卿', '陈梅', '李鑫', '钱润',
        '钱刘熠辉', '宋述斌', '唐世镇', '王锦', '谢琛', '姚傲寒', '郑岩', '陈哲锋', '范知礼',
        '康祉璐', '李志标', '汪阳红', '谢谊', '徐佳星']

finished = ['康祉璐', '徐佳星', '范知礼', '汪阳红', '李志标', '谢谊', '陈哲锋', '宋述斌', '谢琛',
            '李鑫', '郑岩', '刘行思', '夏楠卿', '刘念', '李翔', '何奕源', '姚傲寒', '唐世镇',
            '鄢淦威']

for finish_ in finished:
    all_.remove(finish_)


"""
对没有讲过的人进行随机排序，按从左到右的顺序进行工作汇报。程序由其他公证人执行，可以保证公平性。
"""
import random
random.shuffle(all_)
print(all_)
